In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [2]:
labels = ['Felix','Hud','Abiral']
my_list = [1,4,5]
arr = np.array([1,4,5])
d = {'Felix':1,'Hud':4,'Abiral':5}

In [3]:
pd.Series(data=my_list)

0    1
1    4
2    5
dtype: int64

In [4]:
print("Familarity With Python")
pd.Series(data=my_list,index=labels)

Familarity With Python

Felix     1
Hud       4
Abiral    5
dtype: int64

In [5]:
pd.Series(data = arr)

0    1
1    4
2    5
dtype: int32

In [6]:
pd.Series(arr,labels)

Felix     1
Hud       4
Abiral    5
dtype: int32

In [7]:
ser = pd.Series(d)
ser

Felix     1
Hud       4
Abiral    5
dtype: int64

In [8]:
pd.Series(data=labels)

0     Felix
1       Hud
2    Abiral
dtype: object

In [9]:
ser['Hud']

4

In [10]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])        
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [11]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])     
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [12]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [13]:
ser1.add(ser2)

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [14]:
df = pd.DataFrame(randn(5,4),index=('A', 'B' ,'C','D','E'),columns='W X Y Z'.split())

In [15]:
df

          W         X         Y         Z
A -1.434051 -1.154161 -0.319733 -0.584902
B -0.632581 -0.264013 -0.762066  1.200053
C -0.282600 -0.179011 -1.488848 -2.152932
D -0.166124  1.708096  0.331664  0.310079
E  0.469729  1.645383 -0.158796 -0.114741

In [16]:
type(df)

pandas.core.frame.DataFrame

In [17]:
type(df['W'])

pandas.core.series.Series

In [18]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A -1.434051 -1.154161 -0.319733 -0.584902 -1.753783
B -0.632581 -0.264013 -0.762066  1.200053 -1.394647
C -0.282600 -0.179011 -1.488848 -2.152932 -1.771448
D -0.166124  1.708096  0.331664  0.310079  0.165539
E  0.469729  1.645383 -0.158796 -0.114741  0.310932

In [19]:
df.drop('new',axis=1)

          W         X         Y         Z
A -1.434051 -1.154161 -0.319733 -0.584902
B -0.632581 -0.264013 -0.762066  1.200053
C -0.282600 -0.179011 -1.488848 -2.152932
D -0.166124  1.708096  0.331664  0.310079
E  0.469729  1.645383 -0.158796 -0.114741

In [20]:
df

          W         X         Y         Z       new
A -1.434051 -1.154161 -0.319733 -0.584902 -1.753783
B -0.632581 -0.264013 -0.762066  1.200053 -1.394647
C -0.282600 -0.179011 -1.488848 -2.152932 -1.771448
D -0.166124  1.708096  0.331664  0.310079  0.165539
E  0.469729  1.645383 -0.158796 -0.114741  0.310932

In [21]:
df.drop('new',axis=1,inplace=True)

In [22]:
df

          W         X         Y         Z
A -1.434051 -1.154161 -0.319733 -0.584902
B -0.632581 -0.264013 -0.762066  1.200053
C -0.282600 -0.179011 -1.488848 -2.152932
D -0.166124  1.708096  0.331664  0.310079
E  0.469729  1.645383 -0.158796 -0.114741

In [23]:
df.drop('C',axis=0)

          W         X         Y         Z
A -1.434051 -1.154161 -0.319733 -0.584902
B -0.632581 -0.264013 -0.762066  1.200053
D -0.166124  1.708096  0.331664  0.310079
E  0.469729  1.645383 -0.158796 -0.114741

In [24]:
df

          W         X         Y         Z
A -1.434051 -1.154161 -0.319733 -0.584902
B -0.632581 -0.264013 -0.762066  1.200053
C -0.282600 -0.179011 -1.488848 -2.152932
D -0.166124  1.708096  0.331664  0.310079
E  0.469729  1.645383 -0.158796 -0.114741

In [25]:
# df.loc?

In [26]:
df

          W         X         Y         Z
A -1.434051 -1.154161 -0.319733 -0.584902
B -0.632581 -0.264013 -0.762066  1.200053
C -0.282600 -0.179011 -1.488848 -2.152932
D -0.166124  1.708096  0.331664  0.310079
E  0.469729  1.645383 -0.158796 -0.114741

In [27]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [28]:
df.loc['A']

W   -1.434051
X   -1.154161
Y   -0.319733
Z   -0.584902
Name: A, dtype: float64

In [29]:
df.loc['B','Y']

-0.7620657059111359

In [30]:
df.loc[['A','B'],['W']]

          W
A -1.434051
B -0.632581

In [31]:
df.loc['A':'D','W':'Y']

          W         X         Y
A -1.434051 -1.154161 -0.319733
B -0.632581 -0.264013 -0.762066
C -0.282600 -0.179011 -1.488848
D -0.166124  1.708096  0.331664

In [32]:
df.loc[df.W>0,:]

          W         X         Y         Z
E  0.469729  1.645383 -0.158796 -0.114741

In [33]:
df.loc[:,'Y']

A   -0.319733
B   -0.762066
C   -1.488848
D    0.331664
E   -0.158796
Name: Y, dtype: float64

In [34]:
df

          W         X         Y         Z
A -1.434051 -1.154161 -0.319733 -0.584902
B -0.632581 -0.264013 -0.762066  1.200053
C -0.282600 -0.179011 -1.488848 -2.152932
D -0.166124  1.708096  0.331664  0.310079
E  0.469729  1.645383 -0.158796 -0.114741

In [35]:
df.iloc[2]

W   -0.282600
X   -0.179011
Y   -1.488848
Z   -2.152932
Name: C, dtype: float64

In [36]:
df.iloc[[2,4],1]

C   -0.179011
E    1.645383
Name: X, dtype: float64

In [37]:
list(df.W >0)

[False, False, False, False, True]

In [38]:
df.iloc[list(df.W >0),:]

          W         X         Y         Z
E  0.469729  1.645383 -0.158796 -0.114741

In [39]:
df>0

       W      X      Y      Z
A  False  False  False  False
B  False  False  False   True
C  False  False  False  False
D  False   True   True   True
E   True   True  False  False

In [40]:
df[df>0]

          W         X         Y         Z
A       NaN       NaN       NaN       NaN
B       NaN       NaN       NaN  1.200053
C       NaN       NaN       NaN       NaN
D       NaN  1.708096  0.331664  0.310079
E  0.469729  1.645383       NaN       NaN

In [41]:
df[df['W']>0]

          W         X         Y         Z
E  0.469729  1.645383 -0.158796 -0.114741

In [42]:
df

          W         X         Y         Z
A -1.434051 -1.154161 -0.319733 -0.584902
B -0.632581 -0.264013 -0.762066  1.200053
C -0.282600 -0.179011 -1.488848 -2.152932
D -0.166124  1.708096  0.331664  0.310079
E  0.469729  1.645383 -0.158796 -0.114741

In [43]:
df[df['W']>0]['Y']

E   -0.158796
Name: Y, dtype: float64

In [44]:
df[df['W']>0][['Y','X']]

          Y         X
E -0.158796  1.645383

In [45]:
df[(df['W']>0) & (df['Y'] <0)]

          W         X         Y         Z
E  0.469729  1.645383 -0.158796 -0.114741

In [46]:
df.reset_index(inplace = True)

In [47]:
df

  index         W         X         Y         Z
0     A -1.434051 -1.154161 -0.319733 -0.584902
1     B -0.632581 -0.264013 -0.762066  1.200053
2     C -0.282600 -0.179011 -1.488848 -2.152932
3     D -0.166124  1.708096  0.331664  0.310079
4     E  0.469729  1.645383 -0.158796 -0.114741

In [48]:
df.set_index('index',inplace=True)

In [49]:
df

              W         X         Y         Z
index
A     -1.434051 -1.154161 -0.319733 -0.584902
B     -0.632581 -0.264013 -0.762066  1.200053
C     -0.282600 -0.179011 -1.488848 -2.152932
D     -0.166124  1.708096  0.331664  0.310079
E      0.469729  1.645383 -0.158796 -0.114741

In [50]:
df = pd.DataFrame({'CE':[1,2,0],
                  'CS':[5,0,2],
                  'EE':[11,20,0],
                  'Pharmacy':[23,15,np.nan]},index=['C++','Math','Electrical'])

In [51]:
df

            CE  CS  EE  Pharmacy
C++          1   5  11      23.0
Math         2   0  20      15.0
Electrical   0   2   0       NaN

In [53]:
df.dropna()

      CE  CS  EE  Pharmacy
C++    1   5  11      23.0
Math   2   0  20      15.0

In [54]:
df.dropna(axis=1)

            CE  CS  EE
C++          1   5  11
Math         2   0  20
Electrical   0   2   0

In [55]:
df.dropna(thresh=2)

            CE  CS  EE  Pharmacy
C++          1   5  11      23.0
Math         2   0  20      15.0
Electrical   0   2   0       NaN